content/posts/github-pages-with-hugo-on-Android.org
#+TITLE: Hugo on Android でもGithub Pagesにポストする練習
#+DATE: 2022-02-11T15:44:01+09:00
#+DRAFT: false
#+CATEGORIES[]: 環境構築
#+TAGS[]: GithubPages Hugo Android Termux easy-hugo

いちおう、[[https://hanuomk2.github.io/posts/github-with-termux-on-android/][Termux on Android で Github]]の続き\\
MacOSで構築したGithub Pagesへのポスト環境を
Androidからもポストできる様にする

* 謝辞-参考サイト

[[https://qiita.com/ytbit/items/368a08d491c01090a07c][TermuxでHugo入門の段]]

* Termuxの設定

[[https://hanuomk2.github.io/posts/github-pages-with-hugo-on-macos/][Hugo on MacOS で技術情報サイトをGithub Pagesで公開する]]
で行った様に、Guthub Pages用のテンプレートを作成し、
テーマをインストール

 
#+BEGIN_SRC sh
$ pkg add hugo
$ hugo new site hanuomk2.github.io
$ cd hanuomk2.github.io
$ git clone https://github.com/qqhann/hugo-primer.git themes/hugo-primer --recursive
$ rm -rf themes/hugo-primer/.git #これがあるとgit add -Aでerrorになるので削除
#+END_SRC

* Githubの該当repositoryからsourceをpull

#+BEGIN_SRC sh
$ git init
$ git branch -M main
$ git remote add origin git@github.com:hanuomk2/hanuomk2.github.io.git
$ mv archetypes/default.md archetypes/default.org.md #これがあるとpullでerrorになる
$ mv config.toml config.old.toml #これがあるとpullでerrorになる
$ git pull origin main
#+END_SRC

後は、[[https://hanuomk2.github.io/posts/post-orgmode-format-text-with-hugo-on-macos/][Hugo on MacOS環境でOrgmodeフォーマット記事をポストする練習]]
に従ってポストする

※easy-hugoを使ってみたけど、previewできなかった

※MacOS, AndroidどちらかのOSでポストした後、もう一方のOSでポストする時は、
忘れずにgit pullすること

以上
