docs/posts/github-pages-with-hugo-on-android/index.html
<!DOCTYPE html>
<html>
  <head>
    
    

    
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>
      
  Hugo on Android でもGithub Pagesにポストする練習 &ndash; Odaba&#39;s Blog

    </title>
    
    
    <meta name="description" property="og:description" content="いちおう、Termux on Android で Githubの続き MacOSで構築したGithub Pagesへのポスト環境を Androidからもポストできる様に|">
    

    <meta name="apple-mobile-web-app-title" content="Odaba&#39;s Blog">
    
    
    
    


    <link rel="stylesheet" href="/assets/syntax.css">
    <link rel="stylesheet" href="/assets/primer-build.css">
    <link rel="stylesheet" href="/assets/style.css">
    <link rel="stylesheet" href="/assets/custom_style.css">
  </head>


  <body class="bg-gray">
    <div id="holy" class="container-lg bg-white h-100">

      <div id="header" class="px-1 bg-white">
        <nav class="UnderlineNav UnderlineNav--right px-2">
  <a class="UnderlineNav-actions muted-link h2" href="https://hanuomk2.github.io">
    Odaba&#39;s Blog
  </a>

  
  
</nav>

      </div>

      <div role="main" id="main" class="holy-main markdown-body px-4 bg-white">
        

<div class="Subhead">
  <div class="Subhead-heading">
    <div class="h1 mt-3 mb-1">Hugo on Android でもGithub Pagesにポストする練習</div>
  </div>
  <div class="Subhead-description">
    


<a href='/categories/%E7%92%B0%E5%A2%83%E6%A7%8B%E7%AF%89' class="muted-link">
  <span class="Label Label--gray-darker">環境構築</span>
</a>



<a href='/tags/githubpages' class="muted-link">
  <span class="Label Label--gray">GithubPages</span>
</a>

<a href='/tags/hugo' class="muted-link">
  <span class="Label Label--gray">Hugo</span>
</a>

<a href='/tags/android' class="muted-link">
  <span class="Label Label--gray">Android</span>
</a>

<a href='/tags/termux' class="muted-link">
  <span class="Label Label--gray">Termux</span>
</a>

<a href='/tags/easy-hugo' class="muted-link">
  <span class="Label Label--gray">easy-hugo</span>
</a>



    
    <div class="float-md-right">
      <span title="Lastmod: 2022-02-11. Published at: 2022-02-11.">
        
          Published: 2022-02-11
        
      </span>
    </div>
    
  </div>
</div>
<article>
  
  <section class="pb-6 mb-3 border-bottom">
    
<p>
いちおう、<a href="https://hanuomk2.github.io/posts/github-with-termux-on-android/">Termux on Android で Github</a>の続き<br>
MacOSで構築したGithub Pagesへのポスト環境を
Androidからもポストできる様にする</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
謝辞-参考サイト
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
<a href="https://qiita.com/ytbit/items/368a08d491c01090a07c">TermuxでHugo入門の段</a></p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Termuxの設定
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
<a href="https://hanuomk2.github.io/posts/github-pages-with-hugo-on-macos/">Hugo on MacOS で技術情報サイトをGithub Pagesで公開する</a>
で行った様に、Guthub Pages用のテンプレートを作成し、
テーマをインストール</p>
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-sh" data-lang="sh"><span class="line"><span class="cl">$ pkg add hugo
</span></span><span class="line"><span class="cl">$ hugo new site hanuomk2.github.io
</span></span><span class="line"><span class="cl">$ <span class="nb">cd</span> hanuomk2.github.io
</span></span><span class="line"><span class="cl">$ git clone https://github.com/qqhann/hugo-primer.git themes/hugo-primer --recursive
</span></span><span class="line"><span class="cl">$ rm -rf themes/hugo-primer/.git <span class="c1">#これがあるとgit add -Aでerrorになるので削除</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Githubの該当repositoryからsourceをpull
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div class="src src-sh">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-sh" data-lang="sh"><span class="line"><span class="cl">$ git init
</span></span><span class="line"><span class="cl">$ git branch -M main
</span></span><span class="line"><span class="cl">$ git remote add origin git@github.com:hanuomk2/hanuomk2.github.io.git
</span></span><span class="line"><span class="cl">$ mv archetypes/default.md archetypes/default.org.md <span class="c1">#これがあるとpullでerrorになる</span>
</span></span><span class="line"><span class="cl">$ mv config.toml config.old.toml <span class="c1">#これがあるとpullでerrorになる</span>
</span></span><span class="line"><span class="cl">$ git pull origin main</span></span></code></pre></div>
</div>
<p>
後は、<a href="https://hanuomk2.github.io/posts/post-orgmode-format-text-with-hugo-on-macos/">Hugo on MacOS環境でOrgmodeフォーマット記事をポストする練習</a>
に従ってポストする</p>
<p>
※easy-hugoを使ってみたけど、previewできなかった</p>
<p>
※MacOS, AndroidどちらかのOSでポストした後、もう一方のOSでポストする時は、
忘れずにgit pullすること</p>
<p>
以上</p>
</div>
</div>

  </section>

  <section>
    
      
    
  </section>
</article>

      </div>

      <div id="side" class="pr-1 bg-white">
        <aside class="pr-3">
          
  
    <div id="toc" class="Box Box--blue mb-3">
      <b>Hugo on Android でもGithub Pagesにポストする練習</b><nav id="TableOfContents">
<ul>
<li><a href="#headline-1">謝辞-参考サイト</a>
</li>
<li><a href="#headline-2">Termuxの設定</a>
</li>
<li><a href="#headline-3">Githubの該当repositoryからsourceをpull</a>
</li>
</ul>
</nav></div>
  

  
    <div>
      
    </div>
  

        </aside>
      </div>

      <div id="footer" class="pt-2 pb-3 bg-white text-center">
        

  <span class="text-small text-gray">
    ©Odaba 2022 &middot; 

    Powered by the
    <a href="https://github.com/qqhann/hugo-primer" class="link-gray-dark">Hugo-Primer</a> theme for
    <a href="https://gohugo.io" class="link-gray-dark">Hugo</a>.
  </span>


      </div>
    </div>

    
    
    <script type="text/javascript" src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.5/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
    
    <script type="text/x-mathjax-config">MathJax.Hub.Config({ tex2jax: { inlineMath: [['$','$'], ['\\(','\\)']] } });</script>
    
  </body>
</html>
